# Аналитика ЕГЭ  
## версия №2.1
### данная программа открывает файл (файлы) из папки ege и считывает данные (файлы в таблице *.xls).
### программа создает новый файл в формате analytics.xlsx

In [158]:
#подключаем библиотеки
import os
import pandas as pd
import numpy as np

## Функция перевода + и - в 1 и 0
#### в некоторых предметах кроме + и - встречаются цифры (они останутся без изменений)

In [159]:
def plusToNum(s):
    st=''
    for i in s:
        if i == '+':
            st+='1'
        elif i == '-': 
            st +='0'
        else:
            st += i
    arr = [int(i) for i in st]
    return arr

### Считываем файлы из папки
#### (файлы должны быть по одному предмету)

In [160]:
import os
f  = os.listdir()
Files = ['./ege/'+i for i in os.listdir('./ege') if 'xls' in i]
if Files:
    print(Files)
else:
    print('folder is empty')

['./ege/рус.яз.xls']

## уберем лишнии столбцы и выбирим строчку для шапки

In [161]:
table = pd.read_excel(Files[0].strip(), header = 6)
table.drop(table.columns[[0, 1,3,5,7,9,11,15,17,19,21,23,25]], axis=1, inplace=True)
#rus = rus[:33]
# тут была проблема в русском языке
table.head()

,Код МСУ,Код ОО,Класс,Код ППЭ,Аудитория,Фамилия,Имя,Отчество,Серия,Номер,Задания с кратким ответом,Задания с развёрнутым ответом,Первичный балл,Балл
0,901.0,404004.0,11В,801.0,32.0,Орлова,Валерия,Сергеевна,3213.0,356010.0,2+++++5+++++++2+-+-----4,1(1)3(3)1(1)2(3)2(2)2(2)3(3)2(3)0(2)2(2)1(1)1(1),47.0,76.0
1,901.0,404004.0,11В,801.0,14.0,Паскаль,Анна,Александровна,3213.0,331939.0,2+++++5+++++++2++++++++4,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)2(2)1(2)1(1)1(1),56.0,98.0
2,901.0,404004.0,11В,801.0,16.0,Мухутдинова,Валерия,Руслановна,3213.0,332019.0,2+++++5+++++++2++++++--4,1(1)1(3)1(1)3(3)1(2)1(2)2(3)3(3)1(2)0(2)1(1)1(1),47.0,76.0
3,901.0,404004.0,11В,801.0,15.0,Нуреева,Яна,Евгеньевна,3212.0,238331.0,2+++++5+++++++2++++++++4,1(1)3(3)1(1)3(3)2(2)1(2)3(3)3(3)2(2)1(2)1(1)1(1),55.0,96.0
4,901.0,404004.0,11В,801.0,13.0,Пастушенко,Арина,Алексеевна,3213.0,355644.0,2+++++5+++++++2+++++++-3,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)2(2)2(2)1(1)1(1),55.0,96.0

## Меняем имена столбцов
### долго не мог найти такой простой способ )

In [162]:
#rus = rus.rename(columns = ['kod','kod2','class','kodPPE','room','Last name', 'First name', 'Second name','doc_s','doc_number','result_1','result_2','first_ball','ball'])
#table3 = pd.DataFrame(columns=['kod','kod2','class','kodPPE','room','Last name', 'First name', 'Second name','doc_s','doc_number','result_1','result_2','first_ball','ball'])
cols = ['kod','kod2','class','kodPPE','room','Last name', 'First name', 'Second name','doc_s','doc_number','result_1','result_2','first_ball','ball']
table.columns = cols
# функция dropna удаляет строки где есть значения NaN 
table = table.dropna(subset=['kod'])
table[:3]

,kod,kod2,class,kodPPE,room,Last name,First name,Second name,doc_s,doc_number,result_1,result_2,first_ball,ball
0,901.0,404004.0,11В,801.0,32.0,Орлова,Валерия,Сергеевна,3213.0,356010.0,2+++++5+++++++2+-+-----4,1(1)3(3)1(1)2(3)2(2)2(2)3(3)2(3)0(2)2(2)1(1)1(1),47.0,76.0
1,901.0,404004.0,11В,801.0,14.0,Паскаль,Анна,Александровна,3213.0,331939.0,2+++++5+++++++2++++++++4,1(1)3(3)1(1)3(3)2(2)2(2)3(3)3(3)2(2)1(2)1(1)1(1),56.0,98.0
2,901.0,404004.0,11В,801.0,16.0,Мухутдинова,Валерия,Руслановна,3213.0,332019.0,2+++++5+++++++2++++++--4,1(1)1(3)1(1)3(3)1(2)1(2)2(3)3(3)1(2)0(2)1(1)1(1),47.0,76.0

In [170]:
# сделаем правильную индексацию строк, после поломке)
table.index = np.arange(len(table))
#table

### готовим шапку таблицы
# шапку таблицы нужно сделать не зависимой

In [164]:
# количество заданий в первой части
number = len(table.result_1[1])
# готовим шапку
table2 = pd.DataFrame(columns=['Last name'] + [str(i+1) for i in range(number)]+['summa'])
table2.head()

Empty DataFrame
Columns: [Last name, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, summa]
Index: []

[0 rows x 26 columns]


## Обрабатываем данные для одного или более файлов единного предмета
### это уневерсальный способ, который заменет, то что было выше (table)

In [172]:
row = 0
for i in Files:
    table3 = pd.read_excel(Files[0].strip(), header = 6)
    table3.drop(table3.columns[[0, 1,3,5,7,9,11,15,17,19,21,23,25]], axis=1, inplace=True)
    table3.columns = cols
    # функция dropna удаляет строки где есть значения NaN 
    table3 = table3.dropna(subset=['kod'])
    # строчка ниже делает индексацию строк сначала и правильно
    # т.к. после удаление не корректных строк происходит сбой в нумерации
    table3.index = np.arange(len(table3))
    for t,k in enumerate(table3['result_1']):
        buf = plusToNum(k)
        table2.loc[t+row] = [table3['Last name'][t]]+[j for j in buf]+[sum(buf)]
    row += t+1
table2[:3]

,Last name,1,2,3,4,5,6,7,8,9,...,16,17,18,19,20,21,22,23,24,summa
0,Орлова,2,1,1,1,1,1,5,1,1,...,1,0,1,0,0,0,0,0,4,27
1,Паскаль,2,1,1,1,1,1,5,1,1,...,1,1,1,1,1,1,1,1,4,33
2,Мухутдинова,2,1,1,1,1,1,5,1,1,...,1,1,1,1,1,1,0,0,4,31

In [173]:
#сохраним новую таблицу на диск
table2.to_excel('analytics.xlsx')